{
    "nav": {
      "home": "Inicio",
      "projects": "Proyectos",
      "contact": "Contacto"
    },
    "bio": {
      "summary": "Estudiante de Ingeniería Informática con gran interés en ciberseguridad, redes y programación de bajo nivel. Este es mi espacio personal donde comparto proyectos técnicos y aprendizajes.",
      "objective": "💼 Buscando prácticas o posiciones junior en ciberseguridad, redes o desarrollo backend (a partir de junio de 2025)."
    },
    "download": {
      "cv_en": "Descargar CV (EN)",
      "cv_es": "Descargar CV (ES)",
      "cv_fr": "Descargar CV (FR)"
    },
    "footer": {
      "license": "Este sitio está licenciado bajo"
    },
    "projects": {
      "title": "Proyectos Destacados",
      "http_server": "Servidor HTTP de bajo nivel implementado en C usando sockets. Soporta peticiones GET, POST y OPTIONS sin librerías externas.",
      "films_api": "API en Python para gestionar películas, carritos y clientes. Construida con SQLAlchemy, PostgreSQL y Docker.",
      "library_api": "Dos microservicios escritos en Python con Quart. Autenticación personalizada con tokens y gestión de archivos.",
      "libpcap": "Herramienta para capturar, analizar y responder tráfico ARP construida en Python con libpcap. Probada en Mininet y bien documentada."
    },
    "contact": {
      "title": "Contacto",
      "description": "No dudes en escribirme a través de cualquiera de los siguientes canales:"
    },
    "cert": {
      "title": "🎓 Certificaciones y Formación",
      "ccncert": "Curso Introducción a la Ciberseguridad – CCN-CERT Atenea (2024)",
      "utad": "Curso de Verano Introducción a la Ciberseguridad – U-tad (2021)",
      "tryhackme": "Avanzando en los laboratorios de ciberseguridad de TryHackMe"
    },
    "skills": {
      "title": "🛠️ Habilidades Técnicas",
      "python": "Python – ⭐⭐⭐⭐☆",
      "c": "C (Sockets) – ⭐⭐⭐⭐☆",
      "docker": "Docker – ⭐⭐⭐☆☆",
      "git": "Git / GitHub – ⭐⭐⭐⭐☆",
      "linux": "Linux – ⭐⭐⭐⭐☆",
      "cyber": "Redes y Ciberseguridad – ⭐⭐⭐⭐☆"
    }
}
  